{
  "puzzle_input": "Alice would gain 54 happiness units by sitting next to Bob.\nAlice would lose 81 happiness units by sitting next to Carol.\nAlice would lose 42 happiness units by sitting next to David.\nAlice would gain 89 happiness units by sitting next to Eric.\nAlice would lose 89 happiness units by sitting next to Frank.\nAlice would gain 97 happiness units by sitting next to George.\nAlice would lose 94 happiness units by sitting next to Mallory.\nBob would gain 3 happiness units by sitting next to Alice.\nBob would lose 70 happiness units by sitting next to Carol.\nBob would lose 31 happiness units by sitting next to David.\nBob would gain 72 happiness units by sitting next to Eric.\nBob would lose 25 happiness units by sitting next to Frank.\nBob would lose 95 happiness units by sitting next to George.\nBob would gain 11 happiness units by sitting next to Mallory.\nCarol would lose 83 happiness units by sitting next to Alice.\nCarol would gain 8 happiness units by sitting next to Bob.\nCarol would gain 35 happiness units by sitting next to David.\nCarol would gain 10 happiness units by sitting next to Eric.\nCarol would gain 61 happiness units by sitting next to Frank.\nCarol would gain 10 happiness units by sitting next to George.\nCarol would gain 29 happiness units by sitting next to Mallory.\nDavid would gain 67 happiness units by sitting next to Alice.\nDavid would gain 25 happiness units by sitting next to Bob.\nDavid would gain 48 happiness units by sitting next to Carol.\nDavid would lose 65 happiness units by sitting next to Eric.\nDavid would gain 8 happiness units by sitting next to Frank.\nDavid would gain 84 happiness units by sitting next to George.\nDavid would gain 9 happiness units by sitting next to Mallory.\nEric would lose 51 happiness units by sitting next to Alice.\nEric would lose 39 happiness units by sitting next to Bob.\nEric would gain 84 happiness units by sitting next to Carol.\nEric would lose 98 happiness units by sitting next to David.\nEric would lose 20 happiness units by sitting next to Frank.\nEric would lose 6 happiness units by sitting next to George.\nEric would gain 60 happiness units by sitting next to Mallory.\nFrank would gain 51 happiness units by sitting next to Alice.\nFrank would gain 79 happiness units by sitting next to Bob.\nFrank would gain 88 happiness units by sitting next to Carol.\nFrank would gain 33 happiness units by sitting next to David.\nFrank would gain 43 happiness units by sitting next to Eric.\nFrank would gain 77 happiness units by sitting next to George.\nFrank would lose 3 happiness units by sitting next to Mallory.\nGeorge would lose 14 happiness units by sitting next to Alice.\nGeorge would lose 12 happiness units by sitting next to Bob.\nGeorge would lose 52 happiness units by sitting next to Carol.\nGeorge would gain 14 happiness units by sitting next to David.\nGeorge would lose 62 happiness units by sitting next to Eric.\nGeorge would lose 18 happiness units by sitting next to Frank.\nGeorge would lose 17 happiness units by sitting next to Mallory.\nMallory would lose 36 happiness units by sitting next to Alice.\nMallory would gain 76 happiness units by sitting next to Bob.\nMallory would lose 34 happiness units by sitting next to Carol.\nMallory would gain 37 happiness units by sitting next to David.\nMallory would gain 40 happiness units by sitting next to Eric.\nMallory would gain 18 happiness units by sitting next to Frank.\nMallory would gain 7 happiness units by sitting next to George.",
  "test_input": "Alice would gain 54 happiness units by sitting next to Bob.\nAlice would lose 79 happiness units by sitting next to Carol.\nAlice would lose 2 happiness units by sitting next to David.\nBob would gain 83 happiness units by sitting next to Alice.\nBob would lose 7 happiness units by sitting next to Carol.\nBob would lose 63 happiness units by sitting next to David.\nCarol would lose 62 happiness units by sitting next to Alice.\nCarol would gain 60 happiness units by sitting next to Bob.\nCarol would gain 55 happiness units by sitting next to David.\nDavid would gain 46 happiness units by sitting next to Alice.\nDavid would lose 7 happiness units by sitting next to Bob.\nDavid would gain 41 happiness units by sitting next to Carol.",
  "test_1_result": 330,
  "test_2_result": 286
}